; domain
(define (domain grid)
(:requirements :strips)
(:predicates (conn ?x ?y)
             (key-shape ?k ?s)
             (lock-shape ?x ?s)
             (at ?r ?x )
	     (at-robot ?x)
             (place ?p)
             (key ?k)
             (shape ?s)
             (locked ?x)
             (holding ?k)
             (open ?x)
             (arm-empty ))



(:action unlock
:parameters (?curpos ?lockpos ?key ?shape)
:precondition (and (place ?curpos) (place ?lockpos) (key ?key) (shape ?shape)
          (conn ?curpos ?lockpos) (key-shape ?key ?shape)
                   (lock-shape ?lockpos ?shape) (at-robot ?curpos)
                   (locked ?lockpos) (holding ?key))
:effect (and  (open ?lockpos) (not (locked ?lockpos))))


(:action move
:parameters (?curpos ?nextpos)
:precondition (and (place ?curpos) (place ?nextpos)
               (at-robot ?curpos) (conn ?curpos ?nextpos) (open ?nextpos))
:effect (and (at-robot ?nextpos) (not (at-robot ?curpos))))

(:action pickup
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (at ?key ?curpos) (arm-empty ))
:effect (and (holding ?key)
   (not (at ?key ?curpos)) (not (arm-empty ))))


(:action pickup-and-loose
:parameters (?curpos ?newkey ?oldkey)
:precondition (and (place ?curpos) (key ?newkey) (key ?oldkey)
                  (at-robot ?curpos) (holding ?oldkey) (at ?newkey ?curpos))
:effect (and (holding ?newkey) (at ?oldkey ?curpos)
        (not (holding ?oldkey)) (not (at ?newkey ?curpos))))

(:action putdown
:parameters (?curpos ?key)
:precondition (and (place ?curpos) (key ?key)
                  (at-robot ?curpos) (holding ?key))
:effect (and (arm-empty ) (at ?key ?curpos) (not (holding ?key)))))

; problem
(define (problem grid-x2-y3-t3-k222-l111-p50)
(:domain grid)
(:objects 
        f0-0f f1-0f 
        f0-1f f1-1f 
        f0-2f f1-2f 
        shape0 shape1 shape2 
        key0-0 key0-1 
        key1-0 key1-1 
        key2-0 key2-1 
)
(:init
(arm-empty)
(place f0-0f)
(place f1-0f)
(place f0-1f)
(place f1-1f)
(place f0-2f)
(place f1-2f)
(shape shape0)
(shape shape1)
(shape shape2)
(key key0-0)
(key-shape key0-0 shape0)
(key key0-1)
(key-shape key0-1 shape0)
(key key1-0)
(key-shape key1-0 shape1)
(key key1-1)
(key-shape key1-1 shape1)
(key key2-0)
(key-shape key2-0 shape2)
(key key2-1)
(key-shape key2-1 shape2)
(conn f0-0f f1-0f)
(conn f0-1f f1-1f)
(conn f0-2f f1-2f)
(conn f0-0f f0-1f)
(conn f1-0f f1-1f)
(conn f0-1f f0-2f)
(conn f1-1f f1-2f)
(conn f1-0f f0-0f)
(conn f1-1f f0-1f)
(conn f1-2f f0-2f)
(conn f0-1f f0-0f)
(conn f1-1f f1-0f)
(conn f0-2f f0-1f)
(conn f1-2f f1-1f)
(open f0-0f)
(open f0-2f)
(open f1-2f)
(locked f1-0f)
(lock-shape f1-0f shape0)
(locked f1-1f)
(lock-shape f1-1f shape1)
(locked f0-1f)
(lock-shape f0-1f shape2)
(at key0-0 f0-1f)
(at key0-1 f1-1f)
(at key1-0 f1-0f)
(at key1-1 f1-0f)
(at key2-0 f0-2f)
(at key2-1 f0-0f)
(at-robot f0-2f)
)
(:goal
(and
(at key0-0 f1-0f)
(at key0-1 f1-1f)
(at key2-1 f1-1f)
)
)
)

; plan
1. (pickup f0-2f key2-0)
   deleted: (at key2-0 f0-2f) (arm-empty)
   added: (holding key2-0)
   goals met: 1 of 3
2. (unlock f0-2f f0-1f key2-0 shape2)
   deleted: (locked f0-1f)
   added: (open f0-1f)
   goals met: 1 of 3
3. (move f0-2f f0-1f)
   deleted: (at-robot f0-2f)
   added: (at-robot f0-1f)
   goals met: 1 of 3
4. (pickup-and-loose f0-1f key0-0 key2-0)
   deleted: (holding key2-0) (at key0-0 f0-1f)
   added: (holding key0-0) (at key2-0 f0-1f)
   goals met: 1 of 3
5. (move f0-1f f0-0f)
   deleted: (at-robot f0-1f)
   added: (at-robot f0-0f)
   goals met: 1 of 3
6. (unlock f0-0f f1-0f key0-0 shape0)
   deleted: (locked f1-0f)
   added: (open f1-0f)
   goals met: 1 of 3
7. (move f0-0f f1-0f)
   deleted: (at-robot f0-0f)
   added: (at-robot f1-0f)
   goals met: 1 of 3
8. (pickup-and-loose f1-0f key1-1 key0-0)
   deleted: (holding key0-0) (at key1-1 f1-0f)
   added: (holding key1-1) (at key0-0 f1-0f)
   goals met: 2 of 3
9. (unlock f1-0f f1-1f key1-1 shape1)
   deleted: (locked f1-1f)
   added: (open f1-1f)
   goals met: 2 of 3
10. (move f1-0f f0-0f)
   deleted: (at-robot f1-0f)
   added: (at-robot f0-0f)
   goals met: 2 of 3
11. (pickup-and-loose f0-0f key2-1 key1-1)
   deleted: (holding key1-1) (at key2-1 f0-0f)
   added: (holding key2-1) (at key1-1 f0-0f)
   goals met: 2 of 3
12. (move f0-0f f1-0f)
   deleted: (at-robot f0-0f)
   added: (at-robot f1-0f)
   goals met: 2 of 3
13. (move f1-0f f1-1f)
   deleted: (at-robot f1-0f)
   added: (at-robot f1-1f)
   goals met: 2 of 3
14. (putdown f1-1f key2-1)
   deleted: (holding key2-1)
   added: (arm-empty) (at key2-1 f1-1f)
   goals met: 3 of 3
